const tashrif = {
    columns : ['اسم الآلة', 'اسم المكان', 'اسم الزمان', 'الفعل الناهي', 'فعل الأمر', 'اسم المفعول', 'اسم الفاعل', 'المصدر', 'الفعل المضارع', 'الفعل الماضي'],
    data : [
        [['مِفْعَلٌ'], ['مَفْعَلٌ'], ['مَفْعَلٌ'], ['لاَ تَفْعُلْ'], ['افْعُلْ'], ['مَفْعُوْلٌ'], ['فَاعِلٌ'], ['فَعْلاً'], ['يَفْعُلُ'], ['فَعَلَ']],
        [['مِفْعَلٌ'], ['مَفْعِلٌ'], ['مَفْعِلٌ'], ['لاَ تَفْعِلْ'], ['افْعِلْ'], ['مَفْعُوْلٌ'], ['فَاعِلٌ'], ['فَعْلاً'], ['يَفْعِلُ'], ['فَعَلَ']],
        [['مِفْعَالٌ'], ['مَفْعَلٌ'], ['مَفْعَلٌ'], ['لاَ تَفْعَلْ'], ['افْعَلْ'], ['مَفْعُوْلٌ'], ['فَاعِلٌ'], ['فَعْلاً'], ['يَفْعَلُ'], ['فَعَلَ']],
        [[], ['مَفْعِلٌ'], ['مَفْعِلٌ'], ['لاَ تَفْعِلْ'], ['افْعِلْ'], ['مَفْعُوْلٌ'], ['فَاعِلٌ'], ['فُعْلاَناً'], ['يَفْعِلُ'], ['فَعِلَ']],
        [[], ['مَفْعَلٌ'], ['مَفْعَلٌ'], ['لاَ تَفْعَلْ'], ['افْعَلْ'], ['مَفْعُوْلٌ'], ['فَاعِلٌ'], ['فَعْلاً'], ['يَفْعَلُ'], ['فَعِلَ']],
        [[], ['مَفْعَلٌ'], ['مَفْعَلٌ'], ['لاَ تَفْعُلْ'], ['افْعُلْ'], [], ['فَعَلٌ'], ['فُعْلاً'], ['يَفْعُلُ'], ['فَعُلَ']],
        [[], ['مُفَعَّلٌ'], ['مُفَعَّلٌ'], ['لاَتُفَعِّلْ'], ['فَعِّلْ'], ['مُفَعَّلٌ'], ['مُفَعِّلٌ'], ['تَفْعِلَةً','تِفْعَالاً','تَفْعِيْلاً','تَفْعَالاً'], ['يُفَعِّلُ'], ['فَعَّلَ']],
        [[], ['مُفَاعَلٌ'], ['مُفَاعَلٌ'], ['لاَتُفَاعِلْ'], ['فَاعِلْ'], ['مُفَاعَلٌ'], ['مُفَاعِلٌ'], ['فِعَالاً','مُفَاعَلَةً','فِيْعَالاً'], ['يُفَاعِلُ'], ['فَاعَلَ']],
        [[], ['مُفْعَلٌ'], ['مُفْعَلٌ'], ['لاَتُفْعِلْ'], ['أَفْعِلْ'], ['مُفْعَلٌ'], ['مُفْعِلٌ'], ['إِفْعَالاً'], ['يُفْعِلُ'], ['أَفْعَلَ']],
        [[], ['مُتَفَاعَلٌ'], ['مُتَفَاعَلٌ'], ['لاَتَتَفَاعَلْ'], ['تَفَاعَلْ'], ['مُتَفَاعَلٌ'], ['مُتَفَاعِلٌ'], ['تَفَاعُلاً'], ['يَتَفَاعَلُ'], ['تَفَاعَلَ']],
        [[], ['مُتَفَعَّلٌ'], ['مُتَفَعَّلٌ'], ['لاَتَتَفَعَّلْ'], ['تَفَعَّلْ'], ['مُتَفَعَّلٌ'], ['مُتَفَعِّلٌ'], ['تَفَعُّلاً'], ['يَتَفَعَّلُ'], ['تَفَعَّلَ']],
        [[], ['مُفْتَعَلٌ'], ['مُفْتَعَلٌ'], ['لاَتَفْتَعِلْ'], ['افْتَعِلْ'], ['مُفْتَعَلٌ'], ['مُفْتَعِلٌ'], ['افْتِعَالاً'], ['يَفْتَعِلُ'], ['افْتَعَلَ']],
        [[], ['مُنْفَعَلٌ'], ['مُنْفَعَلٌ'], ['لاَتَنْفَعِلْ'], ['انْفَعِلْ'], ['مُنْفَعَلٌ'], ['مُنْفَعِلٌ'], ['انْفِعَالاً'], ['يَنْفَعِلُ'], ['انْفَعَلَ']],
        [[], ['مُفْعَلٌّ'], ['مُفْعَلٌّ'], ['لاَتَفْعَلَّ'], ['افْعَلَّ'], ['مُفْعَلٌّ'], ['مُفْعَلٌّ'], ['افْعِلاَلاً'], ['يَفْعَلُّ'], ['افْعَلَّ']],
        [[], ['مُسْتَفْعَلٌ'], ['مُسْتَفْعَلٌ'], ['لاَتَسْتَفْعِلْ'], ['اسْتَفْعِلْ'], ['مُسْتَفْعَلٌ'], ['مُسْتَفْعِلٌ'], ['اسْتِفْعَالاً'], ['يَسْتَفْعِلُ'], ['اسْتَفْعَلَ']],
        [[], ['مُفْعَوْعَلٌ'], ['مُفْعَوْعَلٌ'], ['لاَتَفْعَوْعِلْ'], ['افْعَوْعِلْ'], ['مُفْعَوْعَلٌ'], ['مُفْعَوْعِلٌ'], ['افْعِيْعَالاً'], ['يَفْعَوْعِلُ'], ['افْعَوْعَلَ']],
        [[], ['مُفْعَوَّلٌ'], ['مُفْعَوَّلٌ'], ['لاَتَفْعَوِّلْ'], ['افْعَوِّلْ'], ['مُفْعَوَّلٌ'], ['مُفْعَوِّلٌ'], ['افْعِوَّالاً'], ['يَفْعَوِّلُ'], ['افْعَوَّلَ']],
        [[], ['مُفْعَالٌّ'], ['مُفْعَالٌّ'], ['لاَتَفْعَالَّ'], ['افعَالَّ'], ['مُفْعَالٌّ'], ['مُفْعَالُّ'], ['افْعِيْلاَلاً'], ['يَفْعَالُّ'], ['افْعَالَّ']],
        [[], ['مُفَعْلَلٌ'], ['مُفَعْلَلٌ'], ['لاَتُفَعْلِلْ'], ['فَعْلِلْ'], ['مُفَعْلَلٌ'], ['مُفَعْلِلٌ'], ['فِعْلاَلاً', 'فَعْلَلَةً'], ['يُفَعْلِلُ'], ['فَعْلَلَ']],
        [[], ['مُتَفَعْلَلٌ'], ['مُتَفَعْلَلٌ'], ['لاَتَتَفَعْلَلْ'], ['تَفَعْلَلْ'], ['مُتَفَعْلَلٌ'], ['مُتَفَعْلِلٌ'], ['تَفَعْلُلاً'], ['يَتَفَعْلَلُ'], ['تَفَعْلَلَ']],
        [[], ['مُفْعَنْلَلٌ'], ['مُفْعَنْلَلٌ'], ['لاَتَفْعَنْلِلْ'], ['افْعَنْلِلْ'], ['مُفْعَنْلَلٌ'], ['مُفْعَنْلِلٌ'], ['افْعِنْلاَلاً'], ['يَفْعَنْلِلُ'], ['افْعَنْلَلَ']],
        [[], ['مُفْعَلَلٌّ'], ['مُفْعَلَلٌّ'], ['لاَتَفْعَلِلَّ'], ['افْعَلِلَّ'], ['مُفْعَلَلٌّ'], ['مُفْعَلِلٌّ'], ['افْعِلاَّلاً'], ['يَفْعَلِلُّ'], ['افْعَلَلَّ']]
    ],
    metadata: {
        numOfKey: [
            2, 2, 2, 2, 2, 2,
            1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        ],
    },
}

export default tashrif;
